1 Условие 
Известно, что средний чек клиента имеет распределение 855 + LogN(α, σ^2), где LogN - логнормальное распределение. Мы хотим выделить кластер клиентов с наибольшим параметром α. Постройте точечную оценку коэффициента α.

2 Входные данные 
Одномерный массив numpy.ndarray сумм чеков клиента.

З Возвращаемое значение 
Оценка коэффициента α.

4 Оценка 
Максимальный балл: 4. 
+1 балл, если на выборках размера 1000 MSE оценки <= 0.227. 
+1 балл, если на выборках размера 1000 MSE оценки <= 0.0227. 
+1 балл, если на выборках размера 100 MSE оценки <= 0,0642. 
+1 балл, если на выборках размера 10 MSE оценки <= 0.242.

Рещение
Для того чтобы построить точечную оценку коэффициента α, можно воспользоваться методом максимального правдоподобия.

Для логнормального распределения с параметрами μ и σ^2 функция плотности вероятности имеет вид:

f(x) = 1 / (x * σ * sqrt(2π)) * exp(-(ln(x) - μ)^2 / (2 * σ^2))

где x > 0, μ - параметр сдвига, σ^2 - параметр масштаба.

Средний чек клиента имеет распределение 855 + LogN(α, σ^2), то есть параметры распределения следующие:

μ = ln(α)
σ^2 = ?

Для оценки параметра α методом максимального правдоподобия нужно найти такое значение α, при котором вероятность получить наблюдаемые значения среднего чека клиента будет максимальной.

Для этого сначала нужно записать функцию правдоподобия для выборки размера n:

L(α; x1, x2, ..., xn) = ∏(1 / (xi * σ * sqrt(2π)) * exp(-(ln(xi) - ln(α))^2 / (2 * σ^2))), i = 1, ..., n

Логарифмируя функцию правдоподобия и упрощая выражение, получаем:

ln L(α; x1, x2, ..., xn) = -n ln(α) - n ln(σ) - (1/2) * ∑(ln(xi) - ln(α))^2 / σ^2 - n ln(sqrt(2π))

где ∑ обозначает сумму от i=1 до n.

Максимизируя логарифм функции правдоподобия по параметру α, получим:

d(ln L)/dα = -n/α + (1/σ^2) * ∑(ln(xi) - ln(α)) = 0

Отсюда получаем:

α = exp(1/n * ∑ln(xi))

Таким образом, оценкой параметра α методом максимального правдоподобия является:

α̂ = exp(1/n * ∑ln(xi))

где xi - наблюдаемые значения среднего чека клиента в выборке.

Для построения точечной оценки коэффициента α по данному распределению можно использовать формулу, которую мы получили в предыдущем ответе:

α̂ = exp(1/n * ∑ln(xi))

где xi - наблюдаемые значения среднего чека клиента в выборке.

Для решения данной задачи можно написать следующую функцию на языке Python:

import numpy as np


def estimate_alpha(checks):
    n = len(checks)
    ln_checks = np.log(checks)
    alpha_hat = np.exp(np.mean(ln_checks))
    return alpha_hat


Функция принимает на вход одномерный массив checks, содержащий суммы чеков клиента, и возвращает оценку параметра α.

Для проверки корректности работы функции и оценки её точности можно использовать следующий код:


# Создание выборок для проверки точности оценки
samples = []
for i in range(1000):
    samples.append(np.random.lognormal(mean=1.0, sigma=0.5, size=100))

# Проверка оценки на выборках размера 1000
mse = []
for s in samples:
    alpha_hat = estimate_alpha(s)
    mse.append((alpha_hat - 1.0)**2)

mse_1000 = np.mean(mse)
print("MSE на выборках размера 1000:", mse_1000)

# Проверка оценки на выборках размера 100
mse = []
for i in range(1000):
    s = np.random.lognormal(mean=1.0, sigma=0.5, size=100)
    alpha_hat = estimate_alpha(s)
    mse.append((alpha_hat - 1.0)**2)

mse_100 = np.mean(mse)
print("MSE на выборках размера 100:", mse_100)

# Проверка оценки на выборках размера 10
mse = []
for i in range(1000):
    s = np.random.lognormal(mean=1.0, sigma=0.5, size=10)
    alpha_hat = estimate_alpha(s)
    mse.append((alpha_hat - 1.0)**2)

mse_10 = np.mean(mse)
print("MSE на выборках размера 10:", mse_10)


В данном коде мы сгенерировали 1000 выборок различных размеров из логнормального распределения с параметрами μ=1.0 и σ=0.5, а затем для каждой выборки оценили параметр α с помощью функции estimate_alpha. Для оценки точности оценки мы вычислили среднеквадратическое отклонение (MSE) между оценкой параметра α и истинным значением α=1.0.

Результаты работы программы будут зависеть от случайного генерирования выборок, но если функция estimate_alpha реализована корректно, то должны выполнять следующие условия:

MSE на выборках размера 1000 <= 0.227, чтобы получить 1 балл.
MSE на выборках размера 1000 <= 0.0227, чтобы получить 2 балла.
MSE на выборках размера 100 <= 0.0642, чтобы получить 3 балла.
MSE на выборках размера 10 <= 0.242, чтобы получить 4 балла.
При необходимости можно изменять параметры логнормального распределения или другие параметры программы, чтобы получить более точные или надежные результаты.